# Tools and essentials
tap "oven-sh/bun"
tap "Code-Hex/tap"
tap "sl4m/rust-crate"
cask "aerospace"
brew "bun"
brew "certbot"
brew "chezmoi"
brew "cowsay"
brew "docker"
brew "eza"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "jq"
cask "kitty"
brew "less"
brew "lolcat"
brew "moreutils"
brew "mosh"
brew "fastfetch"
brew "neovim"
brew "node"
brew "nvm"
brew "oh-my-posh"
brew "powerlevel10k"
brew "python-tk@3.11"
brew "python@3.11"
brew "ripgrep"
brew "rustup"
brew "sl4m/rust-crate/brew-crate"
cask "stats"
brew "syncthing"
brew "thefuck"
brew "tmux"
brew "tpm"
brew "uv"
brew "wget"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "zoxide"

# Fonts
tap "homebrew/cask-fonts"
cask "font-caskaydia-cove-nerd-font"

# Applications 
tap "homebrew/services"
tap "MaaAssistantArknights/tap"
tap "nikitabobko/tap"
cask "iina"
brew "blender"
brew "maa-cli-beta"
brew "maa-core-beta"
cask "obsidian"
cask "telegram"
cask "plover"
cask "raycast"
cask "zed"
cask "zerotier-one"
