# Tools and essentials
tap "oven-sh/bun"
tap "Code-Hex/tap"
tap "sl4m/rust-crate"
cask "aerospace"
brew "bun"
brew "chezmoi"
brew "cowsay"
brew "docker"
brew "eza"
brew "fortune"
brew "fzf"
brew "imagemagick"
brew "jq"
cask "kitty"
brew "less"
brew "lolcat"
brew "moreutils"
brew "neofetch"
brew "neovim"
brew "node"
brew "oh-my-posh"
brew "powerlevel10k"
brew "python@3.12"
brew "ripgrep"
brew "rustup"
brew "sl4m/rust-crate/brew-crate"
cask "stats"
brew "thefuck"
brew "tmux"
brew "tpm"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "zoxide"

# Fonts
tap "homebrew/cask-fonts"
cask "font-caskaydia-cove-nerd-font"

# Applications
tap "LizardByte/homebrew"
tap "homebrew/services"
cask "background-music"
cask "obsidian"
cask "telegram-desktop"
cask "plover"
brew "sunshine"
#after "services start lizardbyte/homebrew/sunshine"
cask "zerotier-one"
